In [1]:
import pandas as pd

df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33],
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

In [2]:
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [3]:
df.columns

Index(['name', 'age', 'state', 'num_children', 'num_pets'], dtype='object')

In [4]:
df[['name', 'age', 'state']]

    name  age       state
0   john   23        iowa
1   mary   78          dc
2  peter   22  california
3   jeff   19       texas
4   bill   45  washington
5   lisa   33          dc

In [5]:
df.loc[2:4, 'name']

2    peter
3     jeff
4     bill
Name: name, dtype: object

In [7]:
df.loc[2:4, ['name', 'age']]

    name  age
2  peter   22
3   jeff   19
4   bill   45

In [8]:
df.iloc[:2]

   name  age state  num_children  num_pets
0  john   23  iowa             2         0
1  mary   78    dc             2         4

In [10]:
df.iloc[-2:]

   name  age       state  num_children  num_pets
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [11]:
df.loc[:2]

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0

In [12]:
df.iloc[:,0]

0     john
1     mary
2    peter
3     jeff
4     bill
5     lisa
Name: name, dtype: object

In [13]:
df.loc[:,['age', 'state']]

   age       state
0   23        iowa
1   78          dc
2   22  california
3   19       texas
4   45  washington
5   33          dc

In [14]:
df[['age', 'state']]

   age       state
0   23        iowa
1   78          dc
2   22  california
3   19       texas
4   45  washington
5   33          dc

In [16]:
df.iloc[1]

name            mary
age               78
state             dc
num_children       2
num_pets           4
Name: 1, dtype: object

In [17]:
df[df.age > 30]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [18]:
df[df['age'] > 30]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [19]:
df[df['num_pets'] > df['num_children']]

   name  age  state  num_children  num_pets
1  mary   78     dc             2         4
3  jeff   19  texas             1         5

In [20]:
# people with more pets than children
df[df.num_pets > df.num_children]

   name  age  state  num_children  num_pets
1  mary   78     dc             2         4
3  jeff   19  texas             1         5

In [34]:
df[(df.age > 40) & (df.num_pets > 0)]

   name  age state  num_children  num_pets
1  mary   78    dc             2         4

In [35]:
df[(df.age > 40) | (df.num_pets > 0)]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
3  jeff   19       texas             1         5
4  bill   45  washington             2         0

In [39]:
df.drop(['age','num_children'], axis=1)

    name       state  num_pets
0   john        iowa         0
1   mary          dc         4
2  peter  california         0
3   jeff       texas         5
4   bill  washington         0
5   lisa          dc         0

In [37]:
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [40]:
df.describe()

             age  num_children  num_pets
count   6.000000      6.000000  6.000000
mean   36.666667      1.333333  1.500000
std    22.384518      0.816497  2.345208
min    19.000000      0.000000  0.000000
25%    22.250000      1.000000  0.000000
50%    28.000000      1.500000  0.000000
75%    42.000000      2.000000  3.000000
max    78.000000      2.000000  5.000000

In [41]:
import numpy as np
df[['age', 'num_pets', 'num_children']].mean()

age             36.666667
num_pets         1.500000
num_children     1.333333
dtype: float64

In [42]:
# adds numbers by column, defined by axis variable
df[['age', 'num_pets', 'num_children']].apply(lambda col:np.mean(col), axis=0)

age             36.666667
num_pets         1.500000
num_children     1.333333
dtype: float64

In [43]:
df.age.sum()

220

In [44]:
df.sum()

name                    johnmarypeterjeffbilllisa
age                                           220
state           iowadccaliforniatexaswashingtondc
num_children                                    8
num_pets                                        9
dtype: object

In [45]:
# adds numbers by row, defined by axis variable
df[['age', 'num_pets', 'num_children']].apply(lambda col:np.mean(col), axis=1)

0     8.333333
1    28.000000
2     7.333333
3     8.333333
4    15.666667
5    11.333333
dtype: float64

In [51]:
df[['age']]

   age
0   23
1   78
2   22
3   19
4   45
5   33

In [52]:
df['age']

0    23
1    78
2    22
3    19
4    45
5    33
Name: age, dtype: int64

In [53]:
df.age

0    23
1    78
2    22
3    19
4    45
5    33
Name: age, dtype: int64

In [57]:
print(type(df['age']))

<class 'pandas.core.series.Series'>

In [55]:
print(df['age'].values)

[23 78 22 19 45 33]

In [61]:
print(df[['age']].values)

[[23]
 [78]
 [22]
 [19]
 [45]
 [33]]

In [62]:
print(df[['age']].apply(lambda value: value*2))

   age
0   46
1  156
2   44
3   38
4   90
5   66

In [63]:
df['doubled_age'] = df[['age']].apply(lambda value: value*2)

In [64]:
df

    name  age       state  num_children  num_pets  doubled_age
0   john   23        iowa             2         0           46
1   mary   78          dc             2         4          156
2  peter   22  california             0         0           44
3   jeff   19       texas             1         5           38
4   bill   45  washington             2         0           90
5   lisa   33          dc             1         0           66

In [65]:
df['new_c'] = df['age']*df['num_children']

In [66]:
df

    name  age       state  num_children  num_pets  doubled_age  new_c
0   john   23        iowa             2         0           46     46
1   mary   78          dc             2         4          156    156
2  peter   22  california             0         0           44      0
3   jeff   19       texas             1         5           38     19
4   bill   45  washington             2         0           90     90
5   lisa   33          dc             1         0           66     33

In [67]:
df.new_c_2 = df.new_c

/usr/local/lib/python3.7/site-packages/ipykernel_launcher.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  """Entry point for launching an IPython kernel.

In [68]:
df.sort_values('age', ascending=True)

    name  age       state  num_children  num_pets  doubled_age  new_c
3   jeff   19       texas             1         5           38     19
2  peter   22  california             0         0           44      0
0   john   23        iowa             2         0           46     46
5   lisa   33          dc             1         0           66     33
4   bill   45  washington             2         0           90     90
1   mary   78          dc             2         4          156    156

In [69]:
df[df.apply(lambda row: row['name'].startswith('j'), axis=1)]

   name  age  state  num_children  num_pets  doubled_age  new_c
0  john   23   iowa             2         0           46     46
3  jeff   19  texas             1         5           38     19

In [70]:
from collections import OrderedDict
from pandas import DataFrame
import pandas as pd
import numpy as np

table = OrderedDict((
    ("Item", ['Item0', 'Item0', 'Item1', 'Item1']),
    ('CType',['Gold', 'Bronze', 'Gold', 'Silver']),
    ('USD',  ['1$', '2$', '3$', '4$']),
    ('EU',   ['1€', '2€', '3€', '4€'])
))
d = DataFrame(table)
p = d.pivot(index='Item', columns='CType', values='USD')

In [71]:
df

    name  age       state  num_children  num_pets  doubled_age  new_c
0   john   23        iowa             2         0           46     46
1   mary   78          dc             2         4          156    156
2  peter   22  california             0         0           44      0
3   jeff   19       texas             1         5           38     19
4   bill   45  washington             2         0           90     90
5   lisa   33          dc             1         0           66     33

In [72]:
table

OrderedDict([('Item', ['Item0', 'Item0', 'Item1', 'Item1']),
             ('CType', ['Gold', 'Bronze', 'Gold', 'Silver']),
             ('USD', ['1$', '2$', '3$', '4$']),
             ('EU', ['1€', '2€', '3€', '4€'])])

In [74]:
d

    Item   CType USD  EU
0  Item0    Gold  1$  1€
1  Item0  Bronze  2$  2€
2  Item1    Gold  3$  3€
3  Item1  Silver  4$  4€

In [77]:
p = d.pivot(index='Item', columns='CType', values='USD')

In [78]:
p

CType Bronze Gold Silver
Item
Item0     2$   1$    NaN
Item1    NaN   3$     4$